{"id":"95f94955-46fc-4e30-ab84-529f6566141a","updated_at":"2026-06-07T22:05:14.853Z","updated_by":"elastic","created_at":"2026-06-07T22:03:51.488Z","created_by":"elastic","name":"Suspicious PowerShell Execution","tags":["powershell, execution, T1059.001"],"interval":"5m","enabled":true,"revision":1,"description":"detect suspicious powershell execution","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.56.101:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"dbda481c-f8f0-46a7-985c-858fe48f7e85","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://attack.mitre.org/techniques/T1059/001/"],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["winlogbeat-*"],"query":"winlog.event_id:1 AND process.name:powershell.exe","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
