{"id":"cc30c5c8-24d6-46c9-91e0-acb1a2a40abd","updated_at":"2026-06-05T12:21:32.498Z","updated_by":"elastic","created_at":"2026-06-04T12:41:32.111Z","created_by":"elastic","name":" Privilege Escalation via Sudo","tags":["privilege-escalation, sudo, T1548"],"interval":"5m","enabled":true,"revision":2,"description":"Detect privilege escalation via sudo ","risk_score":70,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.56.101:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"dcc4541d-2423-4c7d-a1e1-a03c81262a6f","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://attack.mitre.org/techniques/T1548/"],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.dataset:system.auth AND process.name:sudo AND user.name:hammad","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
