{"id":"f7963ad2-c40c-402c-9d9d-497cf29cff1a","updated_at":"2026-06-04T11:12:20.201Z","updated_by":"elastic","created_at":"2026-06-04T10:37:34.406Z","created_by":"elastic","name":"Brute Force SSH Attack","tags":["brute-force, ssh, T1110"],"interval":"5m","enabled":true,"revision":1,"description":"Detects 5+ failed SSH logins from same IP in 5 minutes","risk_score":75,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.56.101:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"9488331d-28f4-4b0d-8c99-b6d0e805d455","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://attack.mitre.org/techniques/T1110/"],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.category:authentication AND event.outcome:failure","filters":[],"threshold":{"field":["source.ip"],"value":1,"cardinality":[]},"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
