{"id":"f7b8c349-6fdf-4537-b348-572de86b02de","updated_at":"2026-06-05T10:47:48.170Z","updated_by":"elastic","created_at":"2026-06-04T12:52:54.523Z","created_by":"elastic","name":"Suspicious Shell Process Execution","tags":["execution, process, T1059"],"interval":"5m","enabled":true,"revision":2,"description":"Detect Suspicious Process","risk_score":65,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.56.101:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"d81eb06b-b22f-4748-ba0e-639b8a3ba700","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://attack.mitre.org/techniques/T1059/"],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.dataset:system.syslog AND message:*bash*","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
